Revit 2026 API

# TableCellStyleOverrideOptions Methods

---

The TableCellStyleOverrideOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetAllOverrides | Sets all overrides to a specific value. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

TableCellStyleOverrideOptions Class

Autodesk.Revit.DB Namespace